{
  "topics": {
    "topic01" :{
      "comments": 35,
      "description": "Este tópico discute o uso de hooks no React, um recurso introduzido nas versões mais recentes. Os participantes fazem perguntas sobre como usar hooks como useState e useEffect, qual a diferença entre hooks e classes, e como lidar com efeitos colaterais. Há também discussões sobre boas práticas para escrever componentes funcionais e problemas comuns encontrados ao usar hooks.",
      "likes": 120,
      "profile_name": "João Silva",
      "profile_picture": "https://images.unsplash.com/photo-1511763391445-411d74c93227",
      "title": "Como usar React com Hooks?"
    },
    "topic02" :{
      "comments": 27,
      "description": "O foco deste tópico é discutir as melhores práticas ao desenvolver em Node.js. Os participantes compartilham dicas sobre como organizar projetos, gerenciar dependências e escrever código assíncrono de forma eficaz. O debate também inclui sugestões para melhorar a segurança e evitar vazamentos de memória em aplicativos Node.js.",
      "likes": 85,
      "profile_name": "Maria Oliveira",
      "profile_picture": "https://images.unsplash.com/photo-1535713869082-4b6cdbe78a0d",
      "title": "Melhores práticas para desenvolvimento em Node.js"
    },
    "topic03" :{
      "comments": 40,
      "description": "Este tópico é uma introdução ao Docker, explicando os conceitos básicos de containerização e virtualização. Os usuários discutem como configurar um ambiente Docker, criar e gerenciar containers, e as diferenças entre Docker e outras ferramentas de virtualização. Há também discussões sobre os benefícios do Docker no desenvolvimento e na implantação de aplicativos.",
      "likes": 92,
      "profile_name": "Carlos Pereira",
      "profile_picture": "https://images.unsplash.com/photo-1502767089025-6572583499b3",
      "title": "Introdução ao Docker"
    },
    "topic04" :{
      "comments": 50,
      "description": "Neste tópico, os usuários compartilham dicas e truques para otimizar o desempenho de aplicativos web. As discussões incluem técnicas para melhorar o tempo de carregamento, minimizar o uso de recursos e implementar caching. Além disso, fala-se sobre ferramentas para análise de desempenho e como otimizar componentes front-end para uma melhor experiência do usuário.",
      "likes": 103,
      "profile_name": "Ana Sousa",
      "profile_picture": "https://images.unsplash.com/photo-1488426862026-3ee34a7d66df",
      "title": "Dicas para otimizar desempenho em aplicativos web"
    },
    "topic05" :{
      "comments": 65,
      "description": "Este tópico é voltado para quem está começando a aprender Python. Os participantes trocam dicas sobre os primeiros passos no Python, sugerem recursos e compartilham experiências de aprendizado. As discussões abrangem desde a configuração do ambiente de desenvolvimento até o uso de bibliotecas populares e a escrita de código Pythonic. Há também recomendações de cursos online e materiais para estudo.",
      "likes": 150,
      "profile_name": "Lucas Costa",
      "profile_picture": "https://images.unsplash.com/photo-1542282810-9c772d92839e",
      "title": "Aprendendo Python: um guia para iniciantes"
    },
    "topic06" :{
      "comments": 23,
      "description": "O objetivo deste tópico é explorar as diferentes estruturas de dados em JavaScript. Os participantes discutem o uso de arrays, objetos, sets e maps, e como escolher a estrutura certa para cada caso. Além disso, há debates sobre algoritmos de busca e ordenação, e como otimizar o código para melhorar o desempenho em JavaScript. Algumas conversas também mencionam a compatibilidade entre versões diferentes do ECMAScript.",
      "likes": 74,
      "profile_name": "Sofia Martins",
      "profile_picture": "https://images.unsplash.com/photo-1505860428864-1e1e8a4a6f6a",
      "title": "Estruturas de dados em JavaScript"
    },
    "topic07" :{
      "comments": 15,
      "description": "Neste tópico, os participantes discutem como configurar um servidor Apache para hospedar sites e aplicativos. Os usuários compartilham guias passo a passo para instalação e configuração do Apache, bem como dicas para otimizar a performance do servidor. Outras discussões incluem a configuração de módulos, como o mod_rewrite, e o uso de certificados SSL para segurança.",
      "likes": 60,
      "profile_name": "Rafael Almeida",
      "profile_picture": "https://images.unsplash.com/photo-1504197885-efb7e9abf81f",
      "title": "Como configurar um servidor Apache"
    },
    "topic08" : {
      "comments": 48,
      "description": "Este tópico trata do uso de bancos de dados NoSQL em aplicações modernas. Os participantes discutem as diferenças entre bancos de dados relacionais e NoSQL, e quando é apropriado usar cada um. Além disso, há conversas sobre os tipos de bancos NoSQL, como MongoDB e Cassandra, e como modelar dados para atender às necessidades do aplicativo.",
      "likes": 100,
      "profile_name": "Beatriz Santos",
      "profile_picture": "https://images.unsplash.com/photo-1498050108023-c5249f4df085",
      "title": "Trabalhando com banco de dados NoSQL"
    },
    "topic09" : {
      "comments": 55,
      "description": "Neste tópico, os participantes compartilham conselhos sobre como escrever testes automatizados para garantir a qualidade do software. As discussões abrangem ferramentas e frameworks populares para testes, como Jest e Mocha, bem como estratégias para garantir alta cobertura de testes. Além disso, fala-se sobre a importância dos testes de integração e como automatizar o processo de teste como parte do pipeline de CI/CD.",
      "likes": 110,
      "profile_name": "Guilherme Rodrigues",
      "profile_picture": "https://images.unsplash.com/photo-1560174883-cb55db1f1d50",
      "title": "Guia para escrever testes automatizados"
    },
    "topic10" : {
      "comments": 60,
      "description": "Este tópico é um guia para usar Git e GitHub em projetos de software. Os participantes discutem conceitos básicos, como commits e branches, bem como técnicas avançadas, como rebase e pull requests. As conversas incluem dicas para colaborar com equipes usando GitHub e como configurar repositórios para projetos pessoais ou profissionais.",
      "likes": 135,
      "profile_name": "Camila Rocha",
      "profile_picture": "https://images.unsplash.com/photo-1535930749574-34e9b306c966",
      "title": "Como usar Git e GitHub no seu projeto"
    },
    "topic11" : {
      "comments": 37,
      "description": "Neste tópico, os usuários exploram a implementação de layouts responsivos usando CSS Grid e Flexbox. As discussões incluem exemplos práticos e dicas para criar designs adaptáveis para diferentes dispositivos. Além disso, os participantes compartilham recursos úteis e ferramentas para facilitar o desenvolvimento de layouts complexos em CSS.",
      "likes": 97,
      "profile_name": "Fernanda Cardoso",
      "profile_picture": "https://images.unsplash.com/photo-1508780709619-79562169bc64",
      "title": "Aprendendo a usar CSS Grid e Flexbox"
    },
    "topic12" : {
      "comments": 32,
      "description": "Este tópico aborda a configuração de ambientes de desenvolvimento para diversos projetos. Os usuários compartilham dicas para configurar IDEs, gerenciar dependências e criar scripts para automatizar tarefas comuns. Também são discutidos ambientes de desenvolvimento isolados usando Docker e como configurar ambientes de teste e produção de forma eficiente.",
      "likes": 88,
      "profile_name": "Pedro Gomes",
      "profile_picture": "https://images.unsplash.com/photo-1498050108023-c5249f4df085",
      "title": "Configuração de ambientes de desenvolvimento"
    },
     "topic13" : {
      "comments": 49,
      "description": "Neste tópico, os participantes discutem como criar componentes reutilizáveis em React. As conversas incluem dicas para criar componentes flexíveis e fáceis de manter, bem como padrões de design para componentes. Também são compartilhados exemplos de como criar componentes de forma que possam ser utilizados em diferentes partes de um aplicativo ou entre projetos.",
      "likes": 115,
      "profile_name": "Isabela Ribeiro",
      "profile_picture": "https://images.unsplash.com/photo-1502772066652-27a1c887f39e",
      "title": "Guia para criar componentes reutilizáveis em React"
    },
    "topic14" :{
      "comments": 42,
      "description": "Este tópico é uma introdução ao desenvolvimento mobile com Flutter. Os participantes discutem como começar a trabalhar com Flutter, incluindo configuração do ambiente de desenvolvimento, criação de interfaces e uso de widgets. Além disso, há conversas sobre como otimizar aplicativos Flutter para diferentes plataformas e sugestões para evitar problemas comuns ao desenvolver aplicativos mobile.",
      "likes": 105,
      "profile_name": "Diego Nascimento",
      "profile_picture": "https://images.unsplash.com/photo-1526374965328-7f61d4dc18c5",
      "title": "Introdução ao desenvolvimento mobile com Flutter"
    },
    "topic15" :{
      "comments": 58,
      "description": "Neste tópico, os participantes compartilham dicas para criar APIs RESTful eficientes e robustas. As discussões abrangem boas práticas para estruturar endpoints, uso correto de métodos HTTP, e como garantir a segurança da API. Outros tópicos discutidos incluem a implementação de autenticação e autorização, bem como como testar APIs RESTful de maneira eficaz.",
      "likes": 140,
      "profile_name": "Carolina Barbosa",
      "profile_picture": "https://images.unsplash.com/photo-1580894743639-0f842f56554e",
      "title": "Dicas para criar uma API RESTful"
    },
    "topic16" :{
      "comments": 33,
      "description": "Este tópico aborda as melhores práticas para lidar com erros em aplicações web. Os participantes discutem estratégias para capturar e registrar erros, bem como ferramentas para monitoramento e depuração. Outros tópicos incluem como exibir mensagens de erro úteis para os usuários e como implementar mecanismos de fallback para manter a experiência do usuário mesmo em caso de falhas.",
      "likes": 95,
      "profile_name": "Victor Ferreira",
      "profile_picture": "https://images.unsplash.com/photo-1485893086445-ed8500b03bd3",
      "title": "Como lidar com erros em aplicações web"
    },
    "topic17" :{
      "comments": 27,
      "description": "Neste tópico, os participantes discutem o uso de serviços de computação em nuvem para hospedar aplicativos e gerenciar infraestrutura. As discussões incluem plataformas populares como AWS, Azure e Google Cloud, bem como dicas para escolher os serviços mais adequados. Outros tópicos incluem o gerenciamento de custos na nuvem e como implementar práticas de DevOps em ambientes de cloud.",
      "likes": 89,
      "profile_name": "Alice Pinto",
      "profile_picture": "https://images.unsplash.com/photo-1485629002288-1c79d88d2a25",
      "title": "Trabalhando com serviços de cloud computing"
    },
    "topic18" :{
      "comments": 46,
      "description": "O objetivo deste tópico é discutir as melhores práticas para CI/CD (integração contínua/desdobramento contínuo). Os participantes compartilham dicas sobre como configurar pipelines de CI/CD, bem como ferramentas populares para automação. As discussões incluem maneiras de reduzir tempo de build, garantir alta cobertura de testes e automatizar o processo de lançamento para produção.",
      "likes": 102,
      "profile_name": "Ricardo Vieira",
      "profile_picture": "https://images.unsplash.com/photo-1556732318-15ad446c7de1",
      "title": "Melhores práticas para CI/CD"
    },
    "topic19" :{
      "comments": 57,
      "description": "Este tópico explora padrões de design de software e como eles podem ser aplicados a projetos modernos. Os participantes discutem padrões populares como Singleton, Factory e Observer, bem como quando usar cada um. Outros tópicos incluem como aplicar padrões de design em projetos de diferentes linguagens de programação e como evitar erros comuns ao usar padrões.",
      "likes": 130,
      "profile_name": "Letícia Cunha",
      "profile_picture": "https://images.unsplash.com/photo-1499951360447-b19be1ea9859",
      "title": "Entendendo padrões de design de software"
    },
    "topic20" : {
      "comments": 50,
      "description": "Neste tópico, os participantes exploram o uso de TypeScript em projetos React. As discussões incluem as vantagens do uso de TypeScript, como melhorar a segurança do tipo, e como integrar TypeScript em projetos React existentes. Outros tópicos incluem a configuração do ambiente de desenvolvimento para suportar TypeScript e dicas para escrever código mais seguro e de fácil manutenção.",
      "likes": 112,
      "profile_name": "Mariana Teixeira",
      "profile_picture": "https://images.unsplash.com/photo-1550820362-6d2fd7d57cf5",
      "title": "Como usar TypeScript no React"
    }
  ]
}
